In [2]:
import pandas as pd
import numpy as np

In [2]:
record = {
  'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka', 'Priya', 'Shaurya' ],
  'Age': [21, 19, 20, 18, 17, 21],
  'Stream': ['Math', 'Commerce', 'Science', 'Math', 'Math', 'Science'],
  'Percentage': [88, 92, 95, 70, 65, 78]}

In [3]:
df = pd.DataFrame(record)
df

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
3   Priyanka   18      Math          70
4      Priya   17      Math          65
5    Shaurya   21   Science          78

In [4]:
df[df['Stream'].isin(['Math','Commerce'])]

       Name  Age    Stream  Percentage
0     Ankit   21      Math          88
1      Amit   19  Commerce          92
3  Priyanka   18      Math          70
4     Priya   17      Math          65

In [5]:
df[df.Stream != 'Science']

       Name  Age    Stream  Percentage
0     Ankit   21      Math          88
1      Amit   19  Commerce          92
3  Priyanka   18      Math          70
4     Priya   17      Math          65

In [6]:
df[df.Stream == 'Math']
df[df.Age < 20]
df.loc[((df.Age < 20) & (df.Stream == 'Math')),:]

       Name  Age Stream  Percentage
3  Priyanka   18   Math          70
4     Priya   17   Math          65

In [7]:
len(df.loc[((df.Stream == 'Commerce') | (df.Stream == 'Science')),:])

3

In [8]:
a = df.loc[:,'Percentage'].max()
print(a)
df.loc[df[df.Stream == 'Science'].Percentage.idxmax(), 'Name']

95

'Aishwarya'

In [9]:
df[df.Stream == 'Science']

        Name  Age   Stream  Percentage
2  Aishwarya   20  Science          95
5    Shaurya   21  Science          78

#### 
WAP to create dataframe from {'a': [1, 2, 3, 4, 5], 'b': [2, 3, 4, 5, 6]} and rename the column 'a' with count of those numbers that are divisible by 2 in column `a` and rename the column 'b' with count of those numbers that are divisible by 3 in column `b

In [10]:
table = pd.DataFrame({'a': [1, 2, 3, 4, 5], 'b': [2, 3, 4, 5, 6]})
table

   a  b
0  1  2
1  2  3
2  3  4
3  4  5
4  5  6

In [11]:
fcol = len(table[table['a']%2 == 0])
table = table.rename(columns = {'a':fcol})

scol = len(table[table['b']%3 == 0])
table = table.rename(columns = {'b':scol})
table

   2  2
0  1  2
1  2  3
2  3  4
3  4  5
4  5  6

WAP to add a given row in specified index position in a given dataframe

In [12]:
data = pd.DataFrame({
  'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka', 'Priya', 'Shaurya' ],
  'Age': [21, 19, 20, 18, 17, 21],
  'Stream': ['Math', 'Commerce', 'Science', 'Math', 'Math', 'Science'],
  'Percentage': [88, 92, 95, 70, 65, 78]}
)
data

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
3   Priyanka   18      Math          70
4      Priya   17      Math          65
5    Shaurya   21   Science          78

In [23]:
location = int(input('Enter the location where you want to insert your row : '))

Enter the location where you want to insert your row : 3

In [22]:
name = input('Enter the name of the Student : ')
age = int(input('Enter the Age of the student : '))
Stream = input('Enter the Student\'s stream')
perc = input('Enter the percentage obtained by the student : ')

stu_dict =pd.DataFrame([{
    'Name': name,
    'Age' : age,
    'Stream' : Stream,
    'Percentage' : perc
}])
stu_dict

Enter the name of the Student : Mohit
Enter the Age of the student : 22
Enter the Student's streamScience
Enter the percentage obtained by the student : 82

    Name  Age   Stream Percentage
0  Mohit   22  Science         82

In [26]:
c = pd.concat((data.iloc[:location],stu_dict,data.iloc[location:]),axis =0,ignore_index = True)
c

        Name  Age    Stream Percentage
0      Ankit   21      Math         88
1       Amit   19  Commerce         92
2  Aishwarya   20   Science         95
3      Mohit   22   Science         82
4   Priyanka   18      Math         70
5      Priya   17      Math         65
6    Shaurya   21   Science         78

In the below given dataframe :-

df = pd.DataFrame({'num_legs': [2, 4], 'num_wings': [2, 0]},
index=['falcon', 'dog'])

Add a new row after that row that has 2 legs and 2 wings and if such row is not present then add a new row to top of existing dataframe. 

And new row should has user defined index.
Also update the value of number of wings to 3 that has 4 legs and 0 wings.

In [113]:
df1 = pd.DataFrame({'num_legs':[2,4],'num_wings':[2,0]},index=['falcon','dog'])
df1

        num_legs  num_wings
falcon         2          2
dog            4          0

In [114]:
req_loc = df1.loc[((df1['num_legs'] == 2) & (df1['num_wings'] == 2)),:].index[0]

animal_name = input('Enter the name of the animal : ')
legs = int(input('Enter the no. of legs of the animal : '))
wings = int(input('Enter the no. of wings of the animal : '))

new_animal = {'num_legs': legs,'num_wings': wings}
new_df = pd.DataFrame(new_animal, index=[animal_name])
new_df

Enter the name of the animal : elephant
Enter the no. of legs of the animal : 4
Enter the no. of wings of the animal : 0

          num_legs  num_wings
elephant         4          0

In [115]:
df1 = pd.concat((df1[:req_loc],new_df,df1[req_loc:]), ignore_index = False)
df1 = df1[~df1.index.duplicated()]

In [116]:
df1

          num_legs  num_wings
falcon           2          2
elephant         4          0
dog              4          0

In [128]:
df1.loc[((df1['num_legs'] == 4) & (df1['num_wings'] == 0)),'num_wings'] = 3
df1

          num_legs  num_wings
falcon           2          2
elephant         4          3
dog              4          3